luan12689/SpeakerIdentification/stm32f4discovery_vadG729_ert_rtw/stm32f4discovery_vadG729.c
/*
 * File: stm32f4discovery_vadG729.c
 *
 * Code generated for Simulink model 'stm32f4discovery_vadG729'.
 *
 * Model version                  : 1.75
 * Simulink Coder version         : 9.2 (R2019b) 18-Jul-2019
 * C/C++ source code generated on : Thu Mar 25 10:25:07 2021
 *
 * Target selection: ert.tlc
 * Embedded hardware selection: ARM Compatible->ARM Cortex
 * Code generation objectives: Unspecified
 * Validation result: Not run
 */

#include "stm32f4discovery_vadG729.h"
#include "stm32f4discovery_vadG729_private.h"
#include "stm32f4discovery_vadG729_dt.h"

/* Block signals (default storage) */
B_stm32f4discovery_vadG729_T stm32f4discovery_vadG729_B;

/* Block states (default storage) */
DW_stm32f4discovery_vadG729_T stm32f4discovery_vadG729_DW;

/* Real-time model */
RT_MODEL_stm32f4discovery_vad_T stm32f4discovery_vadG729_M_;
RT_MODEL_stm32f4discovery_vad_T *const stm32f4discovery_vadG729_M =
  &stm32f4discovery_vadG729_M_;

/* Forward declaration for local functions */
static dspcodegen_BiquadFilter_stm32_T *stm32_BiquadFilter_BiquadFilter
  (dspcodegen_BiquadFilter_stm32_T *obj);
static dspcodegen_LPCToLSF_stm32f4di_T *stm32f4discov_LPCToLSF_LPCToLSF
  (dspcodegen_LPCToLSF_stm32f4di_T *obj);
static dspcodegen_ZeroCrossingDetect_T *ZeroCrossingDetector_ZeroCrossi
  (dspcodegen_ZeroCrossingDetect_T *obj);
static void stm32_SystemCore_parenReference(const real32_T varargin_1[240],
  real32_T varargout_1[13]);
static void stm_SystemCore_parenReference_h(const real32_T varargin_1[11],
  real32_T varargout_1[11]);
static void st_SystemCore_parenReference_h0(dspcodegen_LPCToLSF_stm32f4di_T *obj,
  const real32_T varargin_1[11], real32_T varargout_1[10]);
static void s_SystemCore_parenReference_h0a(dspcodegen_LevinsonSolver_1_s_T *obj,
  const real32_T varargin_1[3], real32_T varargout_1[2]);
static real32_T stm32f4discovery_vadG729_sum(const real32_T x[12]);
static real32_T stm32f4discovery_vadG729_sum_k(const real32_T x[10]);
static uint32_T SystemCore_parenReference_h0aq(dspcodegen_ZeroCrossingDetect_T
  *obj, const real32_T varargin_1[81]);
static real32_T stm32f4discovery_vadG729_mod(real32_T x);

/* Function for MATLAB Function: '<Root>/VAD_G729' */
static dspcodegen_BiquadFilter_stm32_T *stm32_BiquadFilter_BiquadFilter
  (dspcodegen_BiquadFilter_stm32_T *obj)
{
  dspcodegen_BiquadFilter_stm32_T *b_obj;
  int32_T i;
  static const real32_T b[5] = { 0.927274346F, -1.85449409F, 0.927274346F,
    1.90594649F, -0.911402404F };

  b_obj = obj;
  obj->isInitialized = 0;

  /* System object Constructor function: dsp.BiquadFilter */
  obj->matlabCodegenIsDeleted = false;

  /* System object Initialization function: dsp.BiquadFilter */
  for (i = 0; i < 5; i++) {
    obj->cSFunObject.coefficients[i] = b[i];
  }

  arm_biquad_cascade_df2T_init_f32(&obj->cSFunObject.S, 1U,
    &obj->cSFunObject.coefficients[0], &obj->cSFunObject.pState[0]);
  return b_obj;
}

/* Function for MATLAB Function: '<Root>/VAD_G729' */
static dspcodegen_LPCToLSF_stm32f4di_T *stm32f4discov_LPCToLSF_LPCToLSF
  (dspcodegen_LPCToLSF_stm32f4di_T *obj)
{
  dspcodegen_LPCToLSF_stm32f4di_T *b_obj;
  b_obj = obj;
  obj->isInitialized = 0;

  /* System object Constructor function: dsp.LPCToLSF */
  obj->cSFunObject.P0_NSteps = 64;
  obj->cSFunObject.P1_NBisects = 4;
  obj->matlabCodegenIsDeleted = false;
  return b_obj;
}

/* Function for MATLAB Function: '<Root>/VAD_G729' */
static dspcodegen_ZeroCrossingDetect_T *ZeroCrossingDetector_ZeroCrossi
  (dspcodegen_ZeroCrossingDetect_T *obj)
{
  dspcodegen_ZeroCrossingDetect_T *b_obj;
  b_obj = obj;
  obj->isInitialized = 0;

  /* System object Constructor function: dsp.ZeroCrossingDetector */
  obj->matlabCodegenIsDeleted = false;

  /* System object Initialization function: dsp.ZeroCrossingDetector */
  obj->cSFunObject.W0_InputBuffer = 0.0F;
  return b_obj;
}

/* Function for MATLAB Function: '<Root>/VAD_G729' */
static void stm32_SystemCore_parenReference(const real32_T varargin_1[240],
  real32_T varargout_1[13])
{
  int32_T i;
  int32_T k;
  int32_T idx1;
  int32_T idx2;
  int32_T idxout;
  real32_T accTmp;

  /* System object Outputs function: dsp.Autocorrelator */
  idxout = 0;
  for (i = 0; i < 13; i++) {
    accTmp = 0.0F;
    idx1 = 0;
    idx2 = i;
    for (k = 0; k < 240 - i; k++) {
      accTmp += varargin_1[idx1] * varargin_1[idx2];
      idx1++;
      idx2++;
    }

    varargout_1[idxout] = accTmp;
    idxout++;
  }
}

/* Function for MATLAB Function: '<Root>/VAD_G729' */
static void stm_SystemCore_parenReference_h(const real32_T varargin_1[11],
  real32_T varargout_1[11])
{
  boolean_T isIEven;
  real32_T rTmpP;
  int32_T b_i;
  real32_T acc;
  int32_T upLim;
  int32_T offset1;
  int32_T offset2;
  int32_T j;
  real32_T rTmpA;

  /* System object Outputs function: dsp.LevinsonSolver */
  if (varargin_1[0] == 0.0F) {
    varargout_1[0] = 1.0F;
    b_i = 1;
    for (offset1 = 0; offset1 < 10; offset1++) {
      varargout_1[b_i] = 0.0F;
      b_i++;
    }
  } else {
    isIEven = false;
    rTmpP = varargin_1[0];
    for (b_i = 0; b_i < 10; b_i++) {
      acc = varargin_1[b_i + 1];
      offset1 = 1;
      offset2 = b_i;
      for (j = 1; j < b_i + 1; j++) {
        acc += varargout_1[offset1] * varargin_1[offset2];
        offset1++;
        offset2--;
      }

      acc *= -(1.0F / rTmpP);
      rTmpP *= 1.0F - acc * acc;
      upLim = b_i >> 1;
      offset1 = 1;
      offset2 = b_i;
      for (j = 1; j <= upLim; j++) {
        rTmpA = varargout_1[offset1];
        varargout_1[offset1] += acc * varargout_1[offset2];
        varargout_1[offset2] += acc * rTmpA;
        offset1++;
        offset2--;
      }

      if (isIEven) {
        offset1 = (b_i + 1) >> 1;
        varargout_1[offset1] += acc * varargout_1[offset1];
      }

      isIEven = !isIEven;
      varargout_1[b_i + 1] = acc;
    }

    varargout_1[0] = 1.0F;
  }
}

/* Function for MATLAB Function: '<Root>/VAD_G729' */
void MWDSP_Poly2Lsp_compute_xXI1XkRD(real32_T G1[], real32_T G2[], const
  real32_T lpc[], int32_T orderLPC, int32_T M1)
{
  int32_T i;
  int32_T tmp;

  /* Formulate G1 and G2 polynomials, and deconvolve known roots: */
  /* lpc[0]=1 */
  G1[0U] = 1.0F;
  G2[0U] = 1.0F;
  for (i = 1; i <= M1; i++) {
    tmp = (orderLPC - i) + 1;
    G1[i] = (-G1[i - 1] + lpc[i]) + lpc[tmp];
    G2[i] = (G2[i - 1] + lpc[i]) - lpc[tmp];
  }
}

/* Function for MATLAB Function: '<Root>/VAD_G729' */
real32_T MWDSP_Poly2Lsp_chebyso_5YbHyn0D(real32_T b[], real32_T x, const
  real32_T f[], int32_T N)
{
  int32_T k;
  b[N] = 0.0F;
  b[N - 1] = 1.0F;
  for (k = N - 2; k >= 0; k--) {
    b[k] = (2.0F * x * b[k + 1] - b[k + 2]) + f[(N - k) - 1];
  }

