luan12689/SpeakerIdentification/stm32f4discovery_vadG729_ert_rtw/stm32f4discovery_vadG729.c
  return (x * b[0U] - b[1U]) + f[N] / 2.0F;
}

/* Function for MATLAB Function: '<Root>/VAD_G729' */
int32_T MWDSP_Poly2Lsp_S_l6LrihYj(real32_T lsp[], const real32_T G1[], const
  real32_T G2[], int32_T NSteps, int32_T NBisects, int32_T M1, int32_T M2,
  real32_T bptr[])
{
  int32_T nf;
  boolean_T ip;
  int32_T indx;
  real32_T j;
  real32_T delta;
  real32_T xlow;
  real32_T ylow;
  real32_T xhigh;
  real32_T yhigh;
  int32_T i;
  real32_T xmid;
  real32_T ymid;

  /* number of found frequencies */
  nf = 0;

  /* indicator for f1 or f2 */
  ip = false;
  indx = 0;
  j = 1.0F;
  delta = 2.0F / (real32_T)NSteps;
  xlow = 1.0F;
  ylow = MWDSP_Poly2Lsp_chebyso_5YbHyn0D(&bptr[0U], 1.0F, &G1[0U], M1);
  while ((nf < (M1 << 1)) && (indx < NSteps)) {
    j -= delta;
    indx++;
    xhigh = xlow;
    yhigh = ylow;
    xlow = j;
    if (!ip) {
      ylow = MWDSP_Poly2Lsp_chebyso_5YbHyn0D(&bptr[0U], j, &G1[0U], M1);
    } else {
      ylow = MWDSP_Poly2Lsp_chebyso_5YbHyn0D(&bptr[0U], j, &G2[0U], M2);
    }

    if (ylow * yhigh < 0.0F) {
      /* this indicates that there exists a root between xlow and xhigh
         sub-divide this interval further and find out exact root */
      for (i = 0; i < NBisects; i++) {
        xmid = (xlow + xhigh) / 2.0F;
        if (!ip) {
          ymid = MWDSP_Poly2Lsp_chebyso_5YbHyn0D(&bptr[0U], xmid, &G1[0U], M1);
        } else {
          ymid = MWDSP_Poly2Lsp_chebyso_5YbHyn0D(&bptr[0U], xmid, &G2[0U], M2);
        }

        if (ylow * ymid <= 0.0F) {
          yhigh = ymid;
          xhigh = xmid;
        } else {
          ylow = ymid;
          xlow = xmid;
        }
      }

      /* Linear interpolation
         xint = xlow - ylow*(xhigh-xlow)/(yhigh-ylow); */
      yhigh -= ylow;
      if (!(yhigh == 0.0F)) {
        xlow -= (xhigh - xlow) / yhigh * ylow;
      }

      lsp[nf] = xlow;
      nf++;
      ip = !ip;
      if (!ip) {
        ylow = MWDSP_Poly2Lsp_chebyso_5YbHyn0D(&bptr[0U], xlow, &G1[0U], M1);
      } else {
        ylow = MWDSP_Poly2Lsp_chebyso_5YbHyn0D(&bptr[0U], xlow, &G2[0U], M2);
      }
    }
  }

  return nf;
}

/* Function for MATLAB Function: '<Root>/VAD_G729' */
int32_T MWDSP_Poly2Lsfr_S_Pj4Rfalb(real32_T lsp[], const real32_T G1[], const
  real32_T G2[], int32_T NSteps, int32_T NBisects, int32_T M1, int32_T M2,
  real32_T bptr[], int32_T P)
{
  int32_T nf;
  int32_T i;
  nf = MWDSP_Poly2Lsp_S_l6LrihYj(&lsp[0], &G1[0U], &G2[0U], NSteps, NBisects, M1,
    M2, &bptr[0U]);
  for (i = 0; i < P; i++) {
    lsp[i] = (real32_T)acos(lsp[i]);
  }

  return nf;
}

/* Function for MATLAB Function: '<Root>/VAD_G729' */
static void st_SystemCore_parenReference_h0(dspcodegen_LPCToLSF_stm32f4di_T *obj,
  const real32_T varargin_1[11], real32_T varargout_1[10])
{
  int32_T i;
  int32_T nf;

  /* System object Outputs function: dsp.LPCToLSF */
  MWDSP_Poly2Lsp_compute_xXI1XkRD(&obj->cSFunObject.W0_G1[0U],
    &obj->cSFunObject.W1_G2[0U], &varargin_1[0], 10, 5);

  /* Compute LSP vectors */
  nf = MWDSP_Poly2Lsfr_S_Pj4Rfalb(&varargout_1[0], &obj->cSFunObject.W0_G1[0U],
    &obj->cSFunObject.W1_G2[0U], 64, 4, 5, 5, &obj->cSFunObject.W2_Cheby[0U], 10);

  /* Output is LSP */
  for (i = nf; i < 10; i++) {
    varargout_1[nf] = 3.14159274F;
    nf++;
  }
}

/* Function for MATLAB Function: '<Root>/VAD_G729' */
static void s_SystemCore_parenReference_h0a(dspcodegen_LevinsonSolver_1_s_T *obj,
  const real32_T varargin_1[3], real32_T varargout_1[2])
{
  real32_T rTmpP;
  real32_T rTmpK;
  real32_T rTmpA1;

  /* System object Outputs function: dsp.LevinsonSolver */
  if (varargin_1[0] == 0.0F) {
    varargout_1[0] = 0.0F;
    varargout_1[1] = 0.0F;
  } else {
    rTmpK = -(1.0F / varargin_1[0]) * varargin_1[1];
    rTmpP = (1.0F - rTmpK * rTmpK) * varargin_1[0];
    obj->cSFunObject.W0_ACOEF_DWORK_IDX[1] = rTmpK;
    varargout_1[0] = rTmpK;
    rTmpK = obj->cSFunObject.W0_ACOEF_DWORK_IDX[1] * varargin_1[1];
    rTmpK = (varargin_1[2] + rTmpK) * -(1.0F / rTmpP);
    rTmpP = obj->cSFunObject.W0_ACOEF_DWORK_IDX[1];
    rTmpA1 = obj->cSFunObject.W0_ACOEF_DWORK_IDX[1];
    obj->cSFunObject.W0_ACOEF_DWORK_IDX[1] = rTmpK * rTmpA1 + rTmpP;
    obj->cSFunObject.W0_ACOEF_DWORK_IDX[2] = rTmpK;
    varargout_1[1] = rTmpK;
    obj->cSFunObject.W0_ACOEF_DWORK_IDX[0] = 1.0F;
  }
}

/* Function for MATLAB Function: '<Root>/VAD_G729' */
static real32_T stm32f4discovery_vadG729_sum(const real32_T x[12])
{
  real32_T y;
  int32_T k;
  y = x[0];
  for (k = 0; k < 11; k++) {
    y += x[k + 1];
  }

  return y;
}

/* Function for MATLAB Function: '<Root>/VAD_G729' */
static real32_T stm32f4discovery_vadG729_sum_k(const real32_T x[10])
{
  real32_T y;
  int32_T k;
  y = x[0];
  for (k = 0; k < 9; k++) {
    y += x[k + 1];
  }

  return y;
}

/* Function for MATLAB Function: '<Root>/VAD_G729' */
static uint32_T SystemCore_parenReference_h0aq(dspcodegen_ZeroCrossingDetect_T
  *obj, const real32_T varargin_1[81])
{
  uint32_T varargout_1;
  dsp_ZeroCrossingDetector_5_st_T *b_obj;
  int32_T idx_this_samp;
  int32_T i;
  b_obj = &obj->cSFunObject;

  /* System object Outputs function: dsp.ZeroCrossingDetector */
  idx_this_samp = 0;
  varargout_1 = 0U;
  for (i = 0; i < 81; i++) {
    if (((b_obj->W0_InputBuffer < 0.0F) && (varargin_1[idx_this_samp] > 0.0F)) ||
        ((b_obj->W0_InputBuffer > 0.0F) && (varargin_1[idx_this_samp] < 0.0F)))
    {
      varargout_1++;
    }

    if (varargin_1[idx_this_samp] != 0.0F) {
      b_obj->W0_InputBuffer = varargin_1[idx_this_samp];
    }

    idx_this_samp++;
  }

  return varargout_1;
}

/* Function for MATLAB Function: '<Root>/VAD_G729' */
static real32_T stm32f4discovery_vadG729_mod(real32_T x)
{
  real32_T r;
  if (rtIsNaNF(x) || rtIsInfF(x)) {
    r = (rtNaNF);
  } else if (x == 0.0F) {
    r = 0.0F;
  } else {
    r = (real32_T)fmod(x, 8.0);
    if (r == 0.0F) {
      r = 0.0F;
    } else {
      if (x < 0.0F) {
        r += 8.0F;
      }
    }
  }

  return r;
}

/* Model step function */
void stm32f4discovery_vadG729_step(void)
{
  int32_T i;
  static const real32_T c[240] = { 0.0799999908F, 0.0800570324F, 0.0802281275F,
    0.0805132166F, 0.0809122697F, 0.0814251378F, 0.0820517316F, 0.0827918723F,
    0.0836454108F, 0.0846121088F, 0.0856917277F, 0.086884F, 0.0881886557F,
    0.0896053091F, 0.0911336616F, 0.0927733555F, 0.0945238844F, 0.0963849202F,
    0.0983559564F, 0.100436516F, 0.102626063F, 0.10492406F, 0.107329972F,
    0.109843142F, 0.112463005F, 0.115188874F, 0.118020095F, 0.120955922F,
    0.123995699F, 0.12713863F, 0.130383924F, 0.133730814F, 0.137178436F,
    0.140725955F, 0.144372448F, 0.14811708F, 0.151958868F, 0.155896887F,
    0.159930184F, 0.164057687F, 0.168278441F, 0.172591344F, 0.176995352F,
    0.181489423F, 0.186072335F, 0.190743074F, 0.195500359F, 0.200343147F,
    0.205270067F, 0.210280046F, 0.215371802F, 0.220544F, 0.225795463F,
    0.231124833F, 0.236530766F, 0.242011979F, 0.247567073F, 0.25319469F,
    0.2588934F, 0.264661878F, 0.270498574F, 0.276402116F, 0.282371044F,
    0.288403809F, 0.294499069F, 0.300655067F, 0.30687049F, 0.31314376F,
    0.319473237F, 0.325857371F, 0.332294643F, 0.338783443F, 0.345322102F,
    0.351909041F, 0.358542621F, 0.365221173F, 0.371943146F, 0.378706723F,
    0.385510325F, 0.392352223F, 0.399230719F, 0.406144172F, 0.413090795F,
    0.42006886F, 0.427076608F, 0.434112489F, 0.441174626F, 0.448261201F,
    0.455370456F, 0.46250084F, 0.469650418F, 0.47681734F, 0.483999968F,
    0.491196573F, 0.498405248F, 0.505624175F, 0.512851596F, 0.520085871F,
    0.527325F, 0.534567297F, 0.54181093F, 0.549054146F, 0.556295037F, 0.563532F,
    0.570763052F, 0.577986479F, 0.585200489F, 0.592403352F, 0.599593103F,
    0.606768191F, 0.613926709F, 0.621066868F, 0.628186882F, 0.635285079F,
    0.642359614F, 0.649408817F, 0.65643084F, 0.663424075F, 0.670386612F,
    0.677316785F, 0.684213F, 0.691073477F, 0.697896361F, 0.704680145F,
    0.711423159F, 0.718123674F, 0.724779904F, 0.731390357F, 0.737953424F,
    0.744467258F, 0.750930488F, 0.757341444F, 0.763698399F, 0.770000041F,
    0.776244521F, 0.78243047F, 0.788556278F, 0.794620454F, 0.80062145F,
    0.806557894F, 0.812428176F, 0.818231046F, 0.823964775F, 0.82962811F,
    0.835219622F, 0.840738F, 0.846181691F, 0.851549506F, 0.856840074F,
    0.862052143F, 0.867184222F, 0.872235298F, 0.877203882F, 0.88208884F,
    0.88688904F, 0.891603231F, 0.896230161F, 0.900768816F, 0.905218F,
    0.909576654F, 0.913843513F, 0.918017805F, 0.922098339F, 0.926084042F,
    0.929974139F, 0.933767438F, 0.937463105F, 0.941060245F, 0.944557846F,
    0.94795531F, 0.951251447F, 0.95444566F, 0.957537174F, 0.960525036F,
    0.963408649F, 0.966187239F, 0.968860209F, 0.971426845F, 0.97388643F,
    0.976238489F, 0.978482306F, 0.980617464F, 0.982643306F, 0.984559357F,
    0.986365199F, 0.988060415F, 0.989644468F, 0.991117F, 0.992477715F,
    0.993726194F, 0.994862199F, 0.995885372F, 0.996795535F, 0.99759239F,
    0.998275816F, 0.998845518F, 0.999301493F, 0.999643564F, 0.999871671F,
    0.999985754F, 1.0F, 0.999219298F, 0.996878445F, 0.992981076F, 0.987533331F,
    0.980543613F, 0.972022891F, 0.961984515F, 0.950444102F, 0.937419653F,
    0.922931552F, 0.907002449F, 0.88965708F, 0.870922685F, 0.850828409F,
    0.829405665F, 0.806687951F, 0.782710671F, 0.757511258F, 0.73112911F,
    0.703605354F, 0.674983F, 0.645306766F, 0.614622951F, 0.5829795F,
    0.550425708F, 0.517012596F, 0.482792258F, 0.447818F, 0.412144542F,
    0.375827551F, 0.338923752F, 0.301490873F, 0.263587236F, 0.225271955F,
    0.186604932F, 0.147646546F, 0.108457617F, 0.069099471F, 0.0296334308F };

  static const real32_T b[13] = { 1.0001F, 0.998890281F, 0.995568514F,
    0.990056813F, 0.982391596F, 0.972623467F, 0.960816443F, 0.947047353F,
    0.931404948F, 0.913988948F, 0.894909143F, 0.874284F, 0.852239609F };

  static const real32_T d[12] = { 0.21398823F, 0.14767693F, 0.07018812F,
    0.00980856456F, -0.020159347F, -0.0238827F, -0.0148007618F, -0.00503292168F,
    0.000121413665F, 0.0011935425F, 0.000659087207F, 0.000150157823F };

