luan12689/SpeakerIdentification/stm32f4discovery_vadG729_ert_rtw/stm32f4discovery_vadG729.c
  boolean_T exitg1;

  /* Gain: '<Root>/Normalizing voice signal between -1.0 to 1.0' */
  for (i = 0; i < 80; i++) {
    stm32f4discovery_vadG729_B.Normalizingvoicesignalbetwe[i] =
      stm32f4discovery_vadG729_P.Normalizingvoicesignalbetween10 * (real32_T)
      stm32f4discovery_vadG729_B.Speech[i];
  }

  /* End of Gain: '<Root>/Normalizing voice signal between -1.0 to 1.0' */

  /* MATLAB Function: '<Root>/VAD_G729' */
  /* MATLAB Function 'VAD_G729': '<S1>:1' */
  /* '<S1>:1:5' vad_flag = vadG729(speech, VAD_cst_param); */
  /* 'vadG729:15' if isempty(biquad) */
  if (!stm32f4discovery_vadG729_DW.biquad_not_empty) {
    /* 'vadG729:17' biquad = dsp.BiquadFilter('SOSMatrix', VAD_cst_param.HPF_sos); */
    stm32_BiquadFilter_BiquadFilter(&stm32f4discovery_vadG729_DW.biquad);
    stm32f4discovery_vadG729_DW.biquad_not_empty = true;

    /* 'vadG729:21' autocorr = dsp.Autocorrelator('MaximumLagSource', 'Property', ... */
    /* 'vadG729:22'                             'MaximumLag', VAD_cst_param.NP); */
    stm32f4discovery_vadG729_DW.autocorr.isInitialized = 0;

    /* System object Constructor function: dsp.Autocorrelator */
    stm32f4discovery_vadG729_DW.autocorr.matlabCodegenIsDeleted = false;

    /* 'vadG729:28' levSolver1 = dsp.LevinsonSolver('AOutputPort', true, ... */
    /* 'vadG729:29'                              'KOutputPort', false); */
    stm32f4discovery_vadG729_DW.levSolver1.isInitialized = 0;

    /* System object Constructor function: dsp.LevinsonSolver */
    stm32f4discovery_vadG729_DW.levSolver1.matlabCodegenIsDeleted = false;

    /* 'vadG729:31' levSolver2 = dsp.LevinsonSolver('AOutputPort', false, ... */
    /* 'vadG729:32'                               'KOutputPort', true); */
    stm32f4discovery_vadG729_DW.levSolver2.isInitialized = 0;

    /* System object Constructor function: dsp.LevinsonSolver */
    stm32f4discovery_vadG729_DW.levSolver2.matlabCodegenIsDeleted = false;

    /* 'vadG729:36' lpc2lsf = dsp.LPCToLSF; */
    stm32f4discov_LPCToLSF_LPCToLSF(&stm32f4discovery_vadG729_DW.lpc2lsf);

    /* 'vadG729:39' zerodet = dsp.ZeroCrossingDetector; */
    ZeroCrossingDetector_ZeroCrossi(&stm32f4discovery_vadG729_DW.zerodet);

    /* 'vadG729:42' VAD_var_param.window_buffer = single(zeros(VAD_cst_param.L_WINDOW - VAD_cst_param.L_FRAME, 1)); */
    memset(&stm32f4discovery_vadG729_DW.VAD_var_param.window_buffer[0], 0, 160U *
           sizeof(real32_T));

    /* 'vadG729:43' VAD_var_param.frm_count = single(0); */
    stm32f4discovery_vadG729_DW.VAD_var_param.frm_count = 0.0F;

    /* 'vadG729:44' VAD_var_param.MeanLSF = single(zeros(VAD_cst_param.M, 1)); */
    for (i = 0; i < 10; i++) {
      stm32f4discovery_vadG729_DW.VAD_var_param.MeanLSF[i] = 0.0F;
    }

    /* 'vadG729:45' VAD_var_param.MeanSE = single(0); */
    stm32f4discovery_vadG729_DW.VAD_var_param.MeanSE = 0.0F;

    /* 'vadG729:46' VAD_var_param.MeanSLE = single(0); */
    stm32f4discovery_vadG729_DW.VAD_var_param.MeanSLE = 0.0F;

    /* 'vadG729:47' VAD_var_param.MeanE = single(0); */
    stm32f4discovery_vadG729_DW.VAD_var_param.MeanE = 0.0F;

    /* 'vadG729:48' VAD_var_param.MeanSZC = single(0); */
    stm32f4discovery_vadG729_DW.VAD_var_param.MeanSZC = 0.0F;

    /* 'vadG729:49' VAD_var_param.count_sil = single(0); */
    stm32f4discovery_vadG729_DW.VAD_var_param.count_sil = 0.0F;

    /* 'vadG729:50' VAD_var_param.count_update = single(0); */
    stm32f4discovery_vadG729_DW.VAD_var_param.count_update = 0.0F;

    /* 'vadG729:51' VAD_var_param.count_ext = single(0); */
    stm32f4discovery_vadG729_DW.VAD_var_param.count_ext = 0.0F;

    /* 'vadG729:52' VAD_var_param.less_count = single(0); */
    stm32f4discovery_vadG729_DW.VAD_var_param.less_count = 0.0F;

    /* 'vadG729:53' VAD_var_param.flag = single(1); */
    stm32f4discovery_vadG729_DW.VAD_var_param.flag = 1.0F;

    /* 'vadG729:54' VAD_var_param.prev_markers = single([1, 1]); */
    stm32f4discovery_vadG729_DW.VAD_var_param.prev_markers[0] = 1.0F;
    stm32f4discovery_vadG729_DW.VAD_var_param.prev_markers[1] = 1.0F;

    /* 'vadG729:55' VAD_var_param.prev_energy = single(0); */
    stm32f4discovery_vadG729_DW.VAD_var_param.prev_energy = 0.0F;

    /* 'vadG729:56' VAD_var_param.Prev_Min = single(Inf); */
    stm32f4discovery_vadG729_DW.VAD_var_param.Prev_Min = (rtInfF);

    /* 'vadG729:57' VAD_var_param.Next_Min = single(Inf); */
    stm32f4discovery_vadG729_DW.VAD_var_param.Next_Min = (rtInfF);

    /* 'vadG729:58' VAD_var_param.Min_buffer = single(Inf * ones(1, VAD_cst_param.No)); */
    for (stm32f4discovery_vadG729_B.v_flag = 0;
         stm32f4discovery_vadG729_B.v_flag < 128;
         stm32f4discovery_vadG729_B.v_flag++) {
      stm32f4discovery_vadG729_DW.VAD_var_param.Min_buffer[stm32f4discovery_vadG729_B.v_flag]
        = (rtInfF);
    }
  }

  /* 'vadG729:62' NOISE = single(0); */
  /* 'vadG729:63' VOICE = single(1); */
  /* 'vadG729:64' v_flag = single(0); */
  /* 'vadG729:65' VAD_var_param.frm_count = single(VAD_var_param.frm_count + 1); */
  stm32f4discovery_vadG729_DW.VAD_var_param.frm_count++;

  /* 'vadG729:70' speech_hp = biquad(32768*speech); */
  for (stm32f4discovery_vadG729_B.v_flag = 0; stm32f4discovery_vadG729_B.v_flag <
       80; stm32f4discovery_vadG729_B.v_flag++) {
    stm32f4discovery_vadG729_B.Normalizingvoicesignalbetwe[stm32f4discovery_vadG729_B.v_flag]
      *= 32768.0F;
  }

  /* System object Outputs function: dsp.BiquadFilter */
  arm_biquad_cascade_df2T_f32(&stm32f4discovery_vadG729_DW.biquad.cSFunObject.S,
    &stm32f4discovery_vadG729_B.Normalizingvoicesignalbetwe[0],
    &stm32f4discovery_vadG729_B.speech_hp[0], 80U);

  /* 'vadG729:73' speech_buf = [VAD_var_param.window_buffer; speech_hp]; */
  memcpy(&stm32f4discovery_vadG729_B.speech_buf[0],
         &stm32f4discovery_vadG729_DW.VAD_var_param.window_buffer[0], 160U *
         sizeof(real32_T));
  memcpy(&stm32f4discovery_vadG729_B.speech_buf[160],
         &stm32f4discovery_vadG729_B.speech_hp[0], 80U * sizeof(real32_T));

  /* 'vadG729:78' speech_win = VAD_cst_param.hamwindow .* speech_buf; */
  /* 'vadG729:81' r = autocorr(speech_win) .* VAD_cst_param.lagwindow; */
  for (stm32f4discovery_vadG729_B.v_flag = 0; stm32f4discovery_vadG729_B.v_flag <
       240; stm32f4discovery_vadG729_B.v_flag++) {
    stm32f4discovery_vadG729_B.c[stm32f4discovery_vadG729_B.v_flag] =
      c[stm32f4discovery_vadG729_B.v_flag] *
      stm32f4discovery_vadG729_B.speech_buf[stm32f4discovery_vadG729_B.v_flag];
  }

  stm32_SystemCore_parenReference(stm32f4discovery_vadG729_B.c,
    stm32f4discovery_vadG729_B.r);
  for (stm32f4discovery_vadG729_B.v_flag = 0; stm32f4discovery_vadG729_B.v_flag <
       13; stm32f4discovery_vadG729_B.v_flag++) {
    stm32f4discovery_vadG729_B.r[stm32f4discovery_vadG729_B.v_flag] *=
      b[stm32f4discovery_vadG729_B.v_flag];
  }

  /* 'vadG729:84' a = levSolver1(r(1:VAD_cst_param.M+1)); */
  stm_SystemCore_parenReference_h(&stm32f4discovery_vadG729_B.r[0],
    stm32f4discovery_vadG729_B.a);

  /* 'vadG729:88' LSF = lpc2lsf(a) / (2 * pi); */
  st_SystemCore_parenReference_h0(&stm32f4discovery_vadG729_DW.lpc2lsf,
    stm32f4discovery_vadG729_B.a, stm32f4discovery_vadG729_B.LSF);
  for (stm32f4discovery_vadG729_B.v_flag = 0; stm32f4discovery_vadG729_B.v_flag <
       10; stm32f4discovery_vadG729_B.v_flag++) {
    stm32f4discovery_vadG729_B.LSF[stm32f4discovery_vadG729_B.v_flag] /=
      6.28318548F;
  }

  /* 'vadG729:91' rc = levSolver2(r(1:3)); */
  s_SystemCore_parenReference_h0a(&stm32f4discovery_vadG729_DW.levSolver2,
    &stm32f4discovery_vadG729_B.r[0], stm32f4discovery_vadG729_B.rc);

  /* 'vadG729:98' Ef = 10 * log10(r(1) / VAD_cst_param.L_WINDOW); */
  stm32f4discovery_vadG729_B.Ef = (real32_T)log10(stm32f4discovery_vadG729_B.r[0]
    / 240.0F) * 10.0F;

