luan12689/SpeakerIdentification/stm32f4discovery_vadG729_ert_rtw/stm32f4discovery_vadG729.c
  /* 'vadG729:101' El = r(1) * VAD_cst_param.lbf_corr(1) + 2 * sum(r(2:end) .* VAD_cst_param.lbf_corr(2:end)); */
  /* 'vadG729:102' El = 10 * log10(El / VAD_cst_param.L_WINDOW); */
  for (stm32f4discovery_vadG729_B.v_flag = 0; stm32f4discovery_vadG729_B.v_flag <
       12; stm32f4discovery_vadG729_B.v_flag++) {
    stm32f4discovery_vadG729_B.r_m[stm32f4discovery_vadG729_B.v_flag] =
      stm32f4discovery_vadG729_B.r[stm32f4discovery_vadG729_B.v_flag + 1] *
      d[stm32f4discovery_vadG729_B.v_flag];
  }

  stm32f4discovery_vadG729_B.El = (real32_T)log10((stm32f4discovery_vadG729_B.r
    [0] * 0.24017939F + 2.0F * stm32f4discovery_vadG729_sum
    (stm32f4discovery_vadG729_B.r_m)) / 240.0F) * 10.0F;

  /* 'vadG729:105' SD = sum((LSF-VAD_var_param.MeanLSF).^2); */
  for (i = 0; i < 10; i++) {
    stm32f4discovery_vadG729_B.SD = stm32f4discovery_vadG729_B.LSF[i] -
      stm32f4discovery_vadG729_DW.VAD_var_param.MeanLSF[i];
    stm32f4discovery_vadG729_B.z1[i] = stm32f4discovery_vadG729_B.SD *
      stm32f4discovery_vadG729_B.SD;
  }

  stm32f4discovery_vadG729_B.SD = stm32f4discovery_vadG729_sum_k
    (stm32f4discovery_vadG729_B.z1);

  /* 'vadG729:108' idx = VAD_cst_param.L_WINDOW - VAD_cst_param.L_NEXT - VAD_cst_param.L_FRAME + 1; */
  /* 'vadG729:109' ZC = double(zerodet(speech_buf(idx:idx+VAD_cst_param.L_FRAME)))/VAD_cst_param.L_FRAME; */
  stm32f4discovery_vadG729_B.x = SystemCore_parenReference_h0aq
    (&stm32f4discovery_vadG729_DW.zerodet,
     &stm32f4discovery_vadG729_B.speech_buf[120]);
  stm32f4discovery_vadG729_B.ZC = (real32_T)stm32f4discovery_vadG729_B.x / 80.0F;

  /* 'vadG729:112' VAD_var_param.Next_Min = min(Ef, VAD_var_param.Next_Min); */
  if ((stm32f4discovery_vadG729_B.Ef <
       stm32f4discovery_vadG729_DW.VAD_var_param.Next_Min) || rtIsNaNF
      (stm32f4discovery_vadG729_DW.VAD_var_param.Next_Min)) {
    stm32f4discovery_vadG729_DW.VAD_var_param.Next_Min =
      stm32f4discovery_vadG729_B.Ef;
  }

  /* 'vadG729:113' Min = min(VAD_var_param.Prev_Min, VAD_var_param.Next_Min); */
  if ((stm32f4discovery_vadG729_DW.VAD_var_param.Prev_Min <
       stm32f4discovery_vadG729_DW.VAD_var_param.Next_Min) || rtIsNaNF
      (stm32f4discovery_vadG729_DW.VAD_var_param.Next_Min)) {
    stm32f4discovery_vadG729_B.Min =
      stm32f4discovery_vadG729_DW.VAD_var_param.Prev_Min;
  } else {
    stm32f4discovery_vadG729_B.Min =
      stm32f4discovery_vadG729_DW.VAD_var_param.Next_Min;
  }

  /* 'vadG729:114' if (mod(VAD_var_param.frm_count, single(8)) == 0) */
  if (stm32f4discovery_vadG729_mod
      (stm32f4discovery_vadG729_DW.VAD_var_param.frm_count) == 0.0F) {
    /* 'vadG729:115' VAD_var_param.Min_buffer = [VAD_var_param.Min_buffer(2:end), VAD_var_param.Next_Min]; */
    memcpy(&stm32f4discovery_vadG729_B.fv[0],
           &stm32f4discovery_vadG729_DW.VAD_var_param.Min_buffer[1], 127U *
           sizeof(real32_T));
    stm32f4discovery_vadG729_B.fv[127] =
      stm32f4discovery_vadG729_DW.VAD_var_param.Next_Min;
    memcpy(&stm32f4discovery_vadG729_DW.VAD_var_param.Min_buffer[0],
           &stm32f4discovery_vadG729_B.fv[0], sizeof(real32_T) << 7U);

    /* 'vadG729:116' VAD_var_param.Prev_Min = min(VAD_var_param.Min_buffer); */
    if (!rtIsNaNF(stm32f4discovery_vadG729_DW.VAD_var_param.Min_buffer[0])) {
      i = 1;
    } else {
      i = 0;
      stm32f4discovery_vadG729_B.v_flag = 2;
      exitg1 = false;
      while ((!exitg1) && (stm32f4discovery_vadG729_B.v_flag < 129)) {
        if (!rtIsNaNF
            (stm32f4discovery_vadG729_DW.VAD_var_param.Min_buffer[stm32f4discovery_vadG729_B.v_flag
             - 1])) {
          i = stm32f4discovery_vadG729_B.v_flag;
          exitg1 = true;
        } else {
          stm32f4discovery_vadG729_B.v_flag++;
        }
      }
    }

    if (i == 0) {
      stm32f4discovery_vadG729_B.dSE =
        stm32f4discovery_vadG729_DW.VAD_var_param.Min_buffer[0];
    } else {
      stm32f4discovery_vadG729_B.dSE =
        stm32f4discovery_vadG729_DW.VAD_var_param.Min_buffer[i - 1];
      while (i + 1 <= 128) {
        if (stm32f4discovery_vadG729_B.dSE >
            stm32f4discovery_vadG729_DW.VAD_var_param.Min_buffer[i]) {
          stm32f4discovery_vadG729_B.dSE =
            stm32f4discovery_vadG729_DW.VAD_var_param.Min_buffer[i];
        }

        i++;
      }
    }

    stm32f4discovery_vadG729_DW.VAD_var_param.Prev_Min =
      stm32f4discovery_vadG729_B.dSE;

    /* 'vadG729:117' VAD_var_param.Next_Min = single(Inf); */
    stm32f4discovery_vadG729_DW.VAD_var_param.Next_Min = (rtInfF);
  }

  /* 'vadG729:120' if (VAD_var_param.frm_count < VAD_cst_param.Ni) */
  if (stm32f4discovery_vadG729_DW.VAD_var_param.frm_count < 32.0F) {
    /* 'vadG729:122' if (Ef < 21) */
    if (stm32f4discovery_vadG729_B.Ef < 21.0F) {
      /* 'vadG729:123' VAD_var_param.less_count = VAD_var_param.less_count + 1; */
      stm32f4discovery_vadG729_DW.VAD_var_param.less_count++;

      /* 'vadG729:124' marker = NOISE; */
      i = 0;
    } else {
      /* 'vadG729:125' else */
      /* 'vadG729:127' marker = VOICE; */
      i = 1;

      /* 'vadG729:128' NE = (VAD_var_param.frm_count - 1) - VAD_var_param.less_count; */
      stm32f4discovery_vadG729_B.El =
        (stm32f4discovery_vadG729_DW.VAD_var_param.frm_count - 1.0F) -
        stm32f4discovery_vadG729_DW.VAD_var_param.less_count;

      /* 'vadG729:130' VAD_var_param.MeanE = (VAD_var_param.MeanE * NE + Ef) / (NE+1); */
      stm32f4discovery_vadG729_DW.VAD_var_param.MeanE =
        (stm32f4discovery_vadG729_DW.VAD_var_param.MeanE *
         stm32f4discovery_vadG729_B.El + stm32f4discovery_vadG729_B.Ef) /
        (stm32f4discovery_vadG729_B.El + 1.0F);

      /* 'vadG729:131' VAD_var_param.MeanSZC = (VAD_var_param.MeanSZC * NE + ZC) / (NE+1); */
      stm32f4discovery_vadG729_DW.VAD_var_param.MeanSZC =
        (stm32f4discovery_vadG729_DW.VAD_var_param.MeanSZC *
         stm32f4discovery_vadG729_B.El + stm32f4discovery_vadG729_B.ZC) /
        (stm32f4discovery_vadG729_B.El + 1.0F);

      /* 'vadG729:132' VAD_var_param.MeanLSF = (VAD_var_param.MeanLSF * NE + LSF) / (NE+1); */
      for (stm32f4discovery_vadG729_B.v_flag = 0;
           stm32f4discovery_vadG729_B.v_flag < 10;
           stm32f4discovery_vadG729_B.v_flag++) {
        stm32f4discovery_vadG729_DW.VAD_var_param.MeanLSF[stm32f4discovery_vadG729_B.v_flag]
          =
          (stm32f4discovery_vadG729_DW.VAD_var_param.MeanLSF[stm32f4discovery_vadG729_B.v_flag]
           * stm32f4discovery_vadG729_B.El +
           stm32f4discovery_vadG729_B.LSF[stm32f4discovery_vadG729_B.v_flag]) /
          (stm32f4discovery_vadG729_B.El + 1.0F);
      }
    }
  } else {
    /* 'vadG729:135' else */
    /* 'vadG729:137' if (VAD_var_param.frm_count == VAD_cst_param.Ni) */
    if (stm32f4discovery_vadG729_DW.VAD_var_param.frm_count == 32.0F) {
      /* 'vadG729:138' VAD_var_param.MeanSE = VAD_var_param.MeanE - 10; */
      stm32f4discovery_vadG729_DW.VAD_var_param.MeanSE =
        stm32f4discovery_vadG729_DW.VAD_var_param.MeanE - 10.0F;

      /* 'vadG729:139' VAD_var_param.MeanSLE = VAD_var_param.MeanE - 12; */
      stm32f4discovery_vadG729_DW.VAD_var_param.MeanSLE =
        stm32f4discovery_vadG729_DW.VAD_var_param.MeanE - 12.0F;
    }

    /* 'vadG729:144' dSE = VAD_var_param.MeanSE - Ef; */
    stm32f4discovery_vadG729_B.dSE =
      stm32f4discovery_vadG729_DW.VAD_var_param.MeanSE -
      stm32f4discovery_vadG729_B.Ef;

    /* 'vadG729:145' dSLE = VAD_var_param.MeanSLE - El; */
    stm32f4discovery_vadG729_B.dSLE =
      stm32f4discovery_vadG729_DW.VAD_var_param.MeanSLE -
      stm32f4discovery_vadG729_B.El;

    /* 'vadG729:146' dSZC = VAD_var_param.MeanSZC - ZC; */
    stm32f4discovery_vadG729_B.dSZC =
      stm32f4discovery_vadG729_DW.VAD_var_param.MeanSZC -
      stm32f4discovery_vadG729_B.ZC;

    /* 'vadG729:149' if (Ef < 21) */
    if (stm32f4discovery_vadG729_B.Ef < 21.0F) {
      /* 'vadG729:150' marker = NOISE; */
      i = 0;
    } else {
      /* 'vadG729:151' else */
      /* 'vadG729:152' marker = vad_decision(dSLE, dSE, SD, dSZC); */
      /* 'vadG729:270' a = single([0.00175, -0.004545455, -25, 20, 0, ... */
      /* 'vadG729:271'      8800, 0, 25, -29.09091, 0, ... */
      /* 'vadG729:272'      14000, 0.928571, -1.5, 0.714285]); */
      /* 'vadG729:274' b = single([0.00085, 0.001159091, -5, -6, -4.7, ... */
      /* 'vadG729:275'      -12.2, 0.0009, -7.0, -4.8182, -5.3, ... */
      /* 'vadG729:276'      -15.5, 1.14285, -9, -2.1428571]); */
      /* 'vadG729:278' dec = single(0); */
      i = 0;

      /* 'vadG729:280' if SD > a(1)*dSZC+b(1) */
      if (stm32f4discovery_vadG729_B.SD > 0.00175F *
          stm32f4discovery_vadG729_B.dSZC + 0.00085F) {
        /* 'vadG729:281' dec = single(1); */
        i = 1;
      } else {
        /* 'vadG729:285' if SD > a(2)*dSZC+b(2) */
        if (stm32f4discovery_vadG729_B.SD > -0.00454545487F *
            stm32f4discovery_vadG729_B.dSZC + 0.00115909101F) {
          /* 'vadG729:286' dec = single(1); */
          i = 1;
        } else {
          /* 'vadG729:290' if dSE < a(3)*dSZC+b(3) */
          if (stm32f4discovery_vadG729_B.dSE < -25.0F *
              stm32f4discovery_vadG729_B.dSZC + -5.0F) {
            /* 'vadG729:291' dec = single(1); */
            i = 1;
          } else {
            /* 'vadG729:295' if dSE < a(4)*dSZC+b(4) */
            if (stm32f4discovery_vadG729_B.dSE < 20.0F *
                stm32f4discovery_vadG729_B.dSZC + -6.0F) {
              /* 'vadG729:296' dec = single(1); */
              i = 1;
            } else {
              /* 'vadG729:300' if dSE < b(5) */
              if (stm32f4discovery_vadG729_B.dSE < -4.7F) {
                /* 'vadG729:301' dec = single(1); */
                i = 1;
              } else {
                /* 'vadG729:305' if dSE < a(6)*SD+b(6) */
                if (stm32f4discovery_vadG729_B.dSE < 8800.0F *
                    stm32f4discovery_vadG729_B.SD + -12.2F) {
                  /* 'vadG729:306' dec = single(1); */
                  i = 1;
                } else {
                  /* 'vadG729:310' if SD > b(7) */
                  if (stm32f4discovery_vadG729_B.SD > 0.0009F) {
                    /* 'vadG729:311' dec = single(1); */
                    i = 1;
                  } else {
                    /* 'vadG729:315' if dSLE < a(8)*dSZC+b(8) */
                    if (stm32f4discovery_vadG729_B.dSLE < 25.0F *
                        stm32f4discovery_vadG729_B.dSZC + -7.0F) {
                      /* 'vadG729:316' dec = single(1); */
                      i = 1;
                    } else {
                      /* 'vadG729:320' if dSLE < a(9)*dSZC+b(9) */
                      if (stm32f4discovery_vadG729_B.dSLE < -29.09091F *
                          stm32f4discovery_vadG729_B.dSZC + -4.8182F) {
                        /* 'vadG729:321' dec = single(1); */
                        i = 1;
                      } else {
                        /* 'vadG729:325' if dSLE < b(10) */
                        if (stm32f4discovery_vadG729_B.dSLE < -5.3F) {
                          /* 'vadG729:326' dec = single(1); */
                          i = 1;
                        } else {
                          /* 'vadG729:330' if dSLE < a(11)*SD+b(11) */
                          if (stm32f4discovery_vadG729_B.dSLE < 14000.0F *
                              stm32f4discovery_vadG729_B.SD + -15.5F) {
                            /* 'vadG729:331' dec = single(1); */
                            i = 1;
                          } else {
                            /* 'vadG729:335' if dSLE > a(12)*dSE+b(12) */
                            if (stm32f4discovery_vadG729_B.dSLE > 0.928571F *
                                stm32f4discovery_vadG729_B.dSE + 1.14285F) {
                              /* 'vadG729:336' dec = single(1); */
                              i = 1;
                            } else {
                              /* 'vadG729:340' if dSLE < a(13)*dSE+b(13) */
                              if (stm32f4discovery_vadG729_B.dSLE < -1.5F *
                                  stm32f4discovery_vadG729_B.dSE + -9.0F) {
                                /* 'vadG729:341' dec = single(1); */
                                i = 1;
                              } else {
                                /* 'vadG729:345' if dSLE < a(14)*dSE+b(14) */
                                if (stm32f4discovery_vadG729_B.dSLE < 0.714285F *
                                    stm32f4discovery_vadG729_B.dSE +
                                    -2.14285707F) {
                                  /* 'vadG729:346' dec = single(1); */
                                  i = 1;
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }

