luan12689/SpeakerIdentification/stm32f4discovery_vadG729_ert_rtw/stm32f4discovery_vadG729.c
    /* 'vadG729:155' v_flag = single(0); */
    stm32f4discovery_vadG729_B.v_flag = 0;

    /* 'vadG729:161' if ((VAD_var_param.prev_markers(1) == VOICE) && (marker == NOISE) ... */
    /* 'vadG729:162'         && (Ef > VAD_var_param.MeanSE + 2) && (Ef > 21)) */
    if ((stm32f4discovery_vadG729_DW.VAD_var_param.prev_markers[0] == 1.0F) &&
        ((i == 0) && (stm32f4discovery_vadG729_B.Ef >
                      stm32f4discovery_vadG729_DW.VAD_var_param.MeanSE + 2.0F) &&
         (stm32f4discovery_vadG729_B.Ef > 21.0F))) {
      /* 'vadG729:163' marker = VOICE; */
      i = 1;

      /* 'vadG729:164' v_flag = single(1); */
      stm32f4discovery_vadG729_B.v_flag = 1;
    }

    /* 'vadG729:168' if (VAD_var_param.flag == 1) */
    if (stm32f4discovery_vadG729_DW.VAD_var_param.flag == 1.0F) {
      /* 'vadG729:169' if ((VAD_var_param.prev_markers(2) == VOICE) ... */
      /* 'vadG729:170'             && (VAD_var_param.prev_markers(1) == VOICE) ... */
      /* 'vadG729:171'             && (marker == NOISE) ... */
      /* 'vadG729:172'             && (abs(Ef - VAD_var_param.prev_energy) <= 3)) */
      if ((stm32f4discovery_vadG729_DW.VAD_var_param.prev_markers[1] == 1.0F) &&
          (stm32f4discovery_vadG729_DW.VAD_var_param.prev_markers[0] == 1.0F) &&
          (i == 0) && ((real32_T)fabs(stm32f4discovery_vadG729_B.Ef -
            stm32f4discovery_vadG729_DW.VAD_var_param.prev_energy) <= 3.0F)) {
        /* 'vadG729:174' VAD_var_param.count_ext = VAD_var_param.count_ext + 1; */
        stm32f4discovery_vadG729_DW.VAD_var_param.count_ext++;

        /* 'vadG729:175' marker = VOICE; */
        i = 1;

        /* 'vadG729:176' v_flag = single(1); */
        stm32f4discovery_vadG729_B.v_flag = 1;

        /* 'vadG729:178' if (VAD_var_param.count_ext <= 4) */
        if (stm32f4discovery_vadG729_DW.VAD_var_param.count_ext <= 4.0F) {
          /* 'vadG729:179' VAD_var_param.flag = single(1); */
          stm32f4discovery_vadG729_DW.VAD_var_param.flag = 1.0F;
        } else {
          /* 'vadG729:180' else */
          /* 'vadG729:181' VAD_var_param.count_ext = single(0); */
          stm32f4discovery_vadG729_DW.VAD_var_param.count_ext = 0.0F;

          /* 'vadG729:182' VAD_var_param.flag = single(0); */
          stm32f4discovery_vadG729_DW.VAD_var_param.flag = 0.0F;
        }
      }
    } else {
      /* 'vadG729:185' else */
      /* 'vadG729:186' VAD_var_param.flag = single(1); */
      stm32f4discovery_vadG729_DW.VAD_var_param.flag = 1.0F;
    }

    /* 'vadG729:189' if (marker == NOISE) */
    if (i == 0) {
      /* 'vadG729:190' VAD_var_param.count_sil = VAD_var_param.count_sil + 1; */
      stm32f4discovery_vadG729_DW.VAD_var_param.count_sil++;
    }

    /* 'vadG729:194' if ((marker == VOICE) && (VAD_var_param.count_sil > 10) ... */
    /* 'vadG729:195'         && (Ef - VAD_var_param.prev_energy <= 3)) */
    if ((i == 1) && (stm32f4discovery_vadG729_DW.VAD_var_param.count_sil > 10.0F)
        && (stm32f4discovery_vadG729_B.Ef -
            stm32f4discovery_vadG729_DW.VAD_var_param.prev_energy <= 3.0F)) {
      /* 'vadG729:196' marker = NOISE; */
      i = 0;

      /* 'vadG729:197' VAD_var_param.count_sil = single(0); */
      stm32f4discovery_vadG729_DW.VAD_var_param.count_sil = 0.0F;
    }

    /* 'vadG729:200' if (marker == VOICE) */
    if (i == 1) {
      /* 'vadG729:201' VAD_var_param.count_sil = single(0); */
      stm32f4discovery_vadG729_DW.VAD_var_param.count_sil = 0.0F;
    }

    /* 'vadG729:205' if ((Ef < VAD_var_param.MeanSE + 3) && (VAD_var_param.frm_count > VAD_cst_param.No) ... */
    /* 'vadG729:206'         && (v_flag == 0) && (rc(2) < 0.6)) */
    if ((stm32f4discovery_vadG729_B.Ef <
         stm32f4discovery_vadG729_DW.VAD_var_param.MeanSE + 3.0F) &&
        (stm32f4discovery_vadG729_DW.VAD_var_param.frm_count > 128.0F) &&
        (stm32f4discovery_vadG729_B.v_flag == 0) &&
        (stm32f4discovery_vadG729_B.rc[1] < 0.6)) {
      /* 'vadG729:207' marker = NOISE; */
      i = 0;
    }

    /* 'vadG729:212' if ((Ef < VAD_var_param.MeanSE + 3) && (rc(2) < 0.75) && (SD < 0.002532959)) */
    if ((stm32f4discovery_vadG729_B.Ef <
         stm32f4discovery_vadG729_DW.VAD_var_param.MeanSE + 3.0F) &&
        (stm32f4discovery_vadG729_B.rc[1] < 0.75F) &&
        (stm32f4discovery_vadG729_B.SD < 0.002532959)) {
      /* 'vadG729:213' VAD_var_param.count_update = VAD_var_param.count_update + 1; */
      stm32f4discovery_vadG729_DW.VAD_var_param.count_update++;

      /* 'vadG729:215' if (VAD_var_param.count_update < VAD_cst_param.INIT_COUNT) */
      if (stm32f4discovery_vadG729_DW.VAD_var_param.count_update < 20.0F) {
        /* 'vadG729:216' COEF = single(0.75); */
        stm32f4discovery_vadG729_B.dSE = 0.75F;

        /* 'vadG729:217' COEFZC = single(0.8); */
        stm32f4discovery_vadG729_B.dSLE = 0.8F;

        /* 'vadG729:218' COEFSD = single(0.6); */
        stm32f4discovery_vadG729_B.dSZC = 0.6F;
      } else if (stm32f4discovery_vadG729_DW.VAD_var_param.count_update < 30.0F)
      {
        /* 'vadG729:219' elseif (VAD_var_param.count_update < VAD_cst_param.INIT_COUNT + 10) */
        /* 'vadG729:220' COEF = single(0.95); */
        stm32f4discovery_vadG729_B.dSE = 0.95F;

        /* 'vadG729:221' COEFZC = single(0.92); */
        stm32f4discovery_vadG729_B.dSLE = 0.92F;

        /* 'vadG729:222' COEFSD = single(0.65); */
        stm32f4discovery_vadG729_B.dSZC = 0.65F;
      } else if (stm32f4discovery_vadG729_DW.VAD_var_param.count_update < 40.0F)
      {
        /* 'vadG729:223' elseif (VAD_var_param.count_update < VAD_cst_param.INIT_COUNT + 20) */
        /* 'vadG729:224' COEF = single(0.97); */
        stm32f4discovery_vadG729_B.dSE = 0.97F;

        /* 'vadG729:225' COEFZC = single(0.94); */
        stm32f4discovery_vadG729_B.dSLE = 0.94F;

        /* 'vadG729:226' COEFSD = single(0.70); */
        stm32f4discovery_vadG729_B.dSZC = 0.7F;
      } else if (stm32f4discovery_vadG729_DW.VAD_var_param.count_update < 50.0F)
      {
        /* 'vadG729:227' elseif (VAD_var_param.count_update < VAD_cst_param.INIT_COUNT + 30) */
        /* 'vadG729:228' COEF = single(0.99); */
        stm32f4discovery_vadG729_B.dSE = 0.99F;

