luan12689/SpeakerIdentification/stm32f4discovery_vadG729_ert_rtw/stm32f4discovery_vadG729.c
        /* 'vadG729:229' COEFZC = single(0.96); */
        stm32f4discovery_vadG729_B.dSLE = 0.96F;

        /* 'vadG729:230' COEFSD = single(0.75); */
        stm32f4discovery_vadG729_B.dSZC = 0.75F;
      } else if (stm32f4discovery_vadG729_DW.VAD_var_param.count_update < 60.0F)
      {
        /* 'vadG729:231' elseif (VAD_var_param.count_update < VAD_cst_param.INIT_COUNT + 40) */
        /* 'vadG729:232' COEF = single(0.995); */
        stm32f4discovery_vadG729_B.dSE = 0.995F;

        /* 'vadG729:233' COEFZC = single(0.99); */
        stm32f4discovery_vadG729_B.dSLE = 0.99F;

        /* 'vadG729:234' COEFSD = single(0.75); */
        stm32f4discovery_vadG729_B.dSZC = 0.75F;
      } else {
        /* 'vadG729:235' else */
        /* 'vadG729:236' COEF = single(0.995); */
        stm32f4discovery_vadG729_B.dSE = 0.995F;

        /* 'vadG729:237' COEFZC = single(0.998); */
        stm32f4discovery_vadG729_B.dSLE = 0.998F;

        /* 'vadG729:238' COEFSD = single(0.75); */
        stm32f4discovery_vadG729_B.dSZC = 0.75F;
      }

      /* 'vadG729:242' VAD_var_param.MeanSE = COEF * VAD_var_param.MeanSE + (1-COEF) * Ef; */
      stm32f4discovery_vadG729_DW.VAD_var_param.MeanSE = (1.0F -
        stm32f4discovery_vadG729_B.dSE) * stm32f4discovery_vadG729_B.Ef +
        stm32f4discovery_vadG729_B.dSE *
        stm32f4discovery_vadG729_DW.VAD_var_param.MeanSE;

      /* 'vadG729:243' VAD_var_param.MeanSLE = COEF * VAD_var_param.MeanSLE + (1-COEF) * El; */
      stm32f4discovery_vadG729_DW.VAD_var_param.MeanSLE = (1.0F -
        stm32f4discovery_vadG729_B.dSE) * stm32f4discovery_vadG729_B.El +
        stm32f4discovery_vadG729_B.dSE *
        stm32f4discovery_vadG729_DW.VAD_var_param.MeanSLE;

      /* 'vadG729:244' VAD_var_param.MeanSZC = COEFZC * VAD_var_param.MeanSZC + (1-COEFZC) * ZC; */
      stm32f4discovery_vadG729_DW.VAD_var_param.MeanSZC = (1.0F -
        stm32f4discovery_vadG729_B.dSLE) * stm32f4discovery_vadG729_B.ZC +
        stm32f4discovery_vadG729_B.dSLE *
        stm32f4discovery_vadG729_DW.VAD_var_param.MeanSZC;

      /* 'vadG729:245' VAD_var_param.MeanLSF = COEFSD * VAD_var_param.MeanLSF + (1-COEFSD) * LSF; */
      for (stm32f4discovery_vadG729_B.v_flag = 0;
           stm32f4discovery_vadG729_B.v_flag < 10;
           stm32f4discovery_vadG729_B.v_flag++) {
        stm32f4discovery_vadG729_DW.VAD_var_param.MeanLSF[stm32f4discovery_vadG729_B.v_flag]
          = (1.0F - stm32f4discovery_vadG729_B.dSZC) *
          stm32f4discovery_vadG729_B.LSF[stm32f4discovery_vadG729_B.v_flag] +
          stm32f4discovery_vadG729_B.dSZC *
          stm32f4discovery_vadG729_DW.VAD_var_param.MeanLSF[stm32f4discovery_vadG729_B.v_flag];
      }
    }

    /* 'vadG729:248' if ((VAD_var_param.frm_count > VAD_cst_param.No) && ((VAD_var_param.MeanSE < Min) &&  (SD < 0.002532959)) || (VAD_var_param.MeanSE > Min + 10 )) */
    if (((stm32f4discovery_vadG729_DW.VAD_var_param.frm_count > 128.0F) &&
         (stm32f4discovery_vadG729_DW.VAD_var_param.MeanSE <
          stm32f4discovery_vadG729_B.Min) && (stm32f4discovery_vadG729_B.SD <
          0.002532959)) || (stm32f4discovery_vadG729_DW.VAD_var_param.MeanSE >
                            stm32f4discovery_vadG729_B.Min + 10.0F)) {
      /* 'vadG729:249' VAD_var_param.MeanSE = Min; */
      stm32f4discovery_vadG729_DW.VAD_var_param.MeanSE =
        stm32f4discovery_vadG729_B.Min;

      /* 'vadG729:250' VAD_var_param.count_update = single(0); */
      stm32f4discovery_vadG729_DW.VAD_var_param.count_update = 0.0F;
    }
  }

  /* 'vadG729:255' VAD_var_param.prev_energy = Ef; */
  stm32f4discovery_vadG729_DW.VAD_var_param.prev_energy =
    stm32f4discovery_vadG729_B.Ef;

  /* 'vadG729:256' VAD_var_param.prev_markers = [marker, VAD_var_param.prev_markers(1)]; */
  stm32f4discovery_vadG729_DW.VAD_var_param.prev_markers[1] =
    stm32f4discovery_vadG729_DW.VAD_var_param.prev_markers[0];
  stm32f4discovery_vadG729_DW.VAD_var_param.prev_markers[0] = (real32_T)i;

  /* 'vadG729:258' idx = VAD_cst_param.L_FRAME + 1; */
  /* 'vadG729:259' VAD_var_param.window_buffer = speech_buf(idx:end); */
  memcpy(&stm32f4discovery_vadG729_DW.VAD_var_param.window_buffer[0],
         &stm32f4discovery_vadG729_B.speech_buf[80], 160U * sizeof(real32_T));

  /* DataTypeConversion: '<Root>/Data Type Conversion 1' incorporates:
   *  MATLAB Function: '<Root>/VAD_G729'
   */
  /* 'vadG729:262' vad_flag = marker; */
  stm32f4discovery_vadG729_B.DataTypeConversion1 = (i != 0);

  /* S-Function (stm32f4_do_write): '<Root>/LED 6' */
  MW_GPIO_WriteBit(3U, 15U, stm32f4discovery_vadG729_B.DataTypeConversion1);

  /* External mode */
  rtExtModeUploadCheckTrigger(1);

  {                                    /* Sample time: [0.01s, 0.0s] */
    rtExtModeUpload(0, (real_T)stm32f4discovery_vadG729_M->Timing.taskTime0);
  }

  /* signal main to stop simulation */
  {                                    /* Sample time: [0.01s, 0.0s] */
    if ((rtmGetTFinal(stm32f4discovery_vadG729_M)!=-1) &&
        !((rtmGetTFinal(stm32f4discovery_vadG729_M)-
           stm32f4discovery_vadG729_M->Timing.taskTime0) >
          stm32f4discovery_vadG729_M->Timing.taskTime0 * (DBL_EPSILON))) {
      rtmSetErrorStatus(stm32f4discovery_vadG729_M, "Simulation finished");
    }

    if (rtmGetStopRequested(stm32f4discovery_vadG729_M)) {
      rtmSetErrorStatus(stm32f4discovery_vadG729_M, "Simulation finished");
    }
  }

  /* Update absolute time for base rate */
  /* The "clockTick0" counts the number of times the code of this task has
   * been executed. The absolute time is the multiplication of "clockTick0"
   * and "Timing.stepSize0". Size of "clockTick0" ensures timer will not
   * overflow during the application lifespan selected.
   */
  stm32f4discovery_vadG729_M->Timing.taskTime0 =
    (++stm32f4discovery_vadG729_M->Timing.clockTick0) *
    stm32f4discovery_vadG729_M->Timing.stepSize0;
}

/* Model initialize function */
void stm32f4discovery_vadG729_initialize(void)
{
  /* Registration code */

  /* initialize non-finites */
  rt_InitInfAndNaN(sizeof(real_T));

  /* initialize real-time model */
  (void) memset((void *)stm32f4discovery_vadG729_M, 0,
                sizeof(RT_MODEL_stm32f4discovery_vad_T));
  rtmSetTFinal(stm32f4discovery_vadG729_M, -1);
  stm32f4discovery_vadG729_M->Timing.stepSize0 = 0.01;

  /* External mode info */
  stm32f4discovery_vadG729_M->Sizes.checksums[0] = (1560476015U);
  stm32f4discovery_vadG729_M->Sizes.checksums[1] = (3313759924U);
  stm32f4discovery_vadG729_M->Sizes.checksums[2] = (3200278889U);
  stm32f4discovery_vadG729_M->Sizes.checksums[3] = (77390448U);

  {
    static const sysRanDType rtAlwaysEnabled = SUBSYS_RAN_BC_ENABLE;
    static RTWExtModeInfo rt_ExtModeInfo;
    static const sysRanDType *systemRan[2];
    stm32f4discovery_vadG729_M->extModeInfo = (&rt_ExtModeInfo);
    rteiSetSubSystemActiveVectorAddresses(&rt_ExtModeInfo, systemRan);
    systemRan[0] = &rtAlwaysEnabled;
    systemRan[1] = &rtAlwaysEnabled;
    rteiSetModelMappingInfoPtr(stm32f4discovery_vadG729_M->extModeInfo,
      &stm32f4discovery_vadG729_M->SpecialInfo.mappingInfo);
    rteiSetChecksumsPtr(stm32f4discovery_vadG729_M->extModeInfo,
                        stm32f4discovery_vadG729_M->Sizes.checksums);
    rteiSetTPtr(stm32f4discovery_vadG729_M->extModeInfo, rtmGetTPtr
                (stm32f4discovery_vadG729_M));
  }

