luan12689/SpeakerIdentification/stm32f4discovery_vadG729_ert_rtw/stm32f4discovery_vadG729.c
  /* block I/O */
  (void) memset(((void *) &stm32f4discovery_vadG729_B), 0,
                sizeof(B_stm32f4discovery_vadG729_T));

  /* states (dwork) */
  (void) memset((void *)&stm32f4discovery_vadG729_DW, 0,
                sizeof(DW_stm32f4discovery_vadG729_T));

  /* data type transition information */
  {
    static DataTypeTransInfo dtInfo;
    (void) memset((char_T *) &dtInfo, 0,
                  sizeof(dtInfo));
    stm32f4discovery_vadG729_M->SpecialInfo.mappingInfo = (&dtInfo);
    dtInfo.numDataTypes = 22;
    dtInfo.dataTypeSizes = &rtDataTypeSizes[0];
    dtInfo.dataTypeNames = &rtDataTypeNames[0];

    /* Block I/O transition table */
    dtInfo.BTransTable = &rtBTransTable;

    /* Parameters transition table */
    dtInfo.PTransTable = &rtPTransTable;
  }

  /* Start for S-Function (stm32f4_discovery_mic_in): '<Root>/Speech' */
  stm32f4_mems_mic_init(8000U, 4000U, 10U, 1U, stm32f4discovery_vadG729_B.Speech);

  /* Start for S-Function (stm32f4_do_write): '<Root>/LED 6' */
  MW_GpioInit(3U, 32768U, 1U, 3U, 0U, 0U);

  /* SystemInitialize for MATLAB Function: '<Root>/VAD_G729' */
  stm32f4discovery_vadG729_DW.biquad_not_empty = false;
  stm32f4discovery_vadG729_DW.biquad.matlabCodegenIsDeleted = true;
  stm32f4discovery_vadG729_DW.levSolver1.matlabCodegenIsDeleted = true;
  stm32f4discovery_vadG729_DW.autocorr.matlabCodegenIsDeleted = true;
  stm32f4discovery_vadG729_DW.levSolver2.matlabCodegenIsDeleted = true;
  stm32f4discovery_vadG729_DW.zerodet.matlabCodegenIsDeleted = true;
  stm32f4discovery_vadG729_DW.lpc2lsf.matlabCodegenIsDeleted = true;
}

/* Model terminate function */
void stm32f4discovery_vadG729_terminate(void)
{
  /* Terminate for MATLAB Function: '<Root>/VAD_G729' */
  if (!stm32f4discovery_vadG729_DW.lpc2lsf.matlabCodegenIsDeleted) {
    stm32f4discovery_vadG729_DW.lpc2lsf.matlabCodegenIsDeleted = true;
    if (stm32f4discovery_vadG729_DW.lpc2lsf.isInitialized == 1) {
      stm32f4discovery_vadG729_DW.lpc2lsf.isInitialized = 2;
    }
  }

  if (!stm32f4discovery_vadG729_DW.zerodet.matlabCodegenIsDeleted) {
    stm32f4discovery_vadG729_DW.zerodet.matlabCodegenIsDeleted = true;
    if (stm32f4discovery_vadG729_DW.zerodet.isInitialized == 1) {
      stm32f4discovery_vadG729_DW.zerodet.isInitialized = 2;
    }
  }

  if (!stm32f4discovery_vadG729_DW.levSolver2.matlabCodegenIsDeleted) {
    stm32f4discovery_vadG729_DW.levSolver2.matlabCodegenIsDeleted = true;
    if (stm32f4discovery_vadG729_DW.levSolver2.isInitialized == 1) {
      stm32f4discovery_vadG729_DW.levSolver2.isInitialized = 2;
    }
  }

  if (!stm32f4discovery_vadG729_DW.autocorr.matlabCodegenIsDeleted) {
    stm32f4discovery_vadG729_DW.autocorr.matlabCodegenIsDeleted = true;
    if (stm32f4discovery_vadG729_DW.autocorr.isInitialized == 1) {
      stm32f4discovery_vadG729_DW.autocorr.isInitialized = 2;
    }
  }

  if (!stm32f4discovery_vadG729_DW.levSolver1.matlabCodegenIsDeleted) {
    stm32f4discovery_vadG729_DW.levSolver1.matlabCodegenIsDeleted = true;
    if (stm32f4discovery_vadG729_DW.levSolver1.isInitialized == 1) {
      stm32f4discovery_vadG729_DW.levSolver1.isInitialized = 2;
    }
  }

  if (!stm32f4discovery_vadG729_DW.biquad.matlabCodegenIsDeleted) {
    stm32f4discovery_vadG729_DW.biquad.matlabCodegenIsDeleted = true;
    if (stm32f4discovery_vadG729_DW.biquad.isInitialized == 1) {
      stm32f4discovery_vadG729_DW.biquad.isInitialized = 2;
    }
  }

  /* End of Terminate for MATLAB Function: '<Root>/VAD_G729' */
}

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
